# HomeWork2

## Тема:
### Таблица в консоли

## Цель:
### В этом задании мы закрепим знания, полученные в ходе вебинара, и сможем воспользоваться циклами и условными операторами

## Описание/Пошаговая инструкция выполнения домашнего задания:
### Нужно написать программу, которое делает следующее:
* Есть функция (назовем ее WriteTable(int n, string s))
Функция принимает на вход параметр n (целое число), и строку s. Если число меньше 1 или больше 6 - выводим текст введите число от 1 до 6 и выходим из функции. Если текст пустой - выводим сообщение текст не может быть пустым и выходим из функции.
* Функция на основе значений n и строки s должна вывести три полоски на основе ASCII-арта

### Требования к программе
* Общая ширина не должна превышать 40 символов
* Границы полосок - символ +
* Ширина полосок (каждой) зависит от числа n и длины введенной строки из п.2.
* Вывести 1ю строку с текстом s, введенным в п.2., который находится на расстоянии n-1 от каждой из границ строки.
* Вывести 2ю строку. Она имеет ту же высоту, что и строка 1, и представляет собой набор символов +, чередующихся в шахматном порядке.
* Вывести 3ю строку таблицы. Она должна быть квадратной, "перечеркнутая" символом + по диагоналям
* В программе должны использоваться циклы do while, while и for и ?: и if
### Примечания
* Для получения длины строки используйте свойство Length, например s.Length
* Для Вывода строки с переносом на следующую строку воспользуйтесь функцией Console.WriteLine
#### Пример
```csharp 
// Console.WriteLine("Privet");
// Console.WriteLine("Otus");
```
```cmd
Privet
Otus
```
* Для Вывода строки без переноса на следующую строку воспользуйтесь функцией Console.Write
#### Пример
``` csharp 
// Console.Write("Privet");
// Console.Write("Otus");
```
```cmd
PrivetOtus
```
### Критерии оценки:
* 2 балла - за каждую строку (итого 6)
* 1 балл - если горизонтальная граница таблицы, будет собрана один раз, а выводится будет одной строкой
* 1 балл, если построение каждой строки будет обернуто в отдельную функцию
* 2 балла, если построение всей таблицы будет проходить в рамках одного цикла, а выбор, какую строку строить - при помощи switch case when
* Для зачета достаточно набрать 6 баллов
